#include "pch.h"
#include <math.h>
#include "Math.h"

/*-------------------------------------
ベクトルの足し算
引数	：足すベクトル(Vec2D* pa, Vec2D b)
戻り値	：
-------------------------------------*/
void SumVec2D(Vec2D* pa, Vec2D b)
{
	pa->x += b.x;
	pa->y += b.y;
}

/*-------------------------------------
ベクトルの引き算
引数	：引くベクトル(Vec2D* pa, Vec2D b)
戻り値	：
-------------------------------------*/
void SubVec2D(Vec2D* pa, Vec2D b)
{
	pa->x -= b.x;
	pa->y -= b.y;
}

/*-------------------------------------
ベクトルを伸ばす
引数	：ベクトルと倍率(Vec2D* pv, float s)
戻り値	：
-------------------------------------*/
void ScaleVec2D(Vec2D* pv, float s)
{
	pv->x *= s;
	pv->y *= s;
}

/*-------------------------------------
ベクトルの長さ
引数	：長さを取得したいベクトル(Vec2D* pv)
戻り値	：長さ
-------------------------------------*/
float LengthVec2D(Vec2D pv)
{
	return sqrtf((pv.x * pv.x) + (pv.y * pv.y));
}

/*-------------------------------------
ベクトルの正規化
引数	：正規化したいベクトル(Vec2D* pv)
戻り値	：
-------------------------------------*/
void NormalizeVec2D(Vec2D* pv)
{
	float len = LengthVec2D(*pv);

	if (len == 0.0f)
	{
		return;
	}

	pv->x /= len;
	pv->y /= len;
}

///////////////////////////
//ラジアン→ディグリーへの変換(弧度法→度数法)
//引数:角度(ラジアン(弧度法))
//戻り値:角度(ディグリー(度数法))
//////////////////////////
double RagianToDegree(double rad)
{
	return rad / PI * 180.0;
}

///////////////////////////
//ディグリー→ラジアンへの変換(度数法→弧度法)
//引数:角度(ディグリー(度数法))
//戻り値:角度(ラジアン(弧度法))
//////////////////////////
double DegreeToRagian(double deg)
{
	return deg / 180.0 * PI;
}
