//////////////////////////
//プレイシーンのUIクラス
//作成日：2021年4月30日
//作成者：GT2_04_稲垣颯太
/////////////////////////

#include "pch.h"
#include "PlaySceneUI.h"


//コンストラクタ
PlaySceneUI::PlaySceneUI()
{
}

//デストラクタ
PlaySceneUI::~PlaySceneUI()
{
}

/////////////////////
//初期化
//引数：なし
//戻り値：なし
/////////////////////
void PlaySceneUI::Initialize()
{
}

/////////////////////
//更新
//引数：なし
//戻り値：なし
/////////////////////
void PlaySceneUI::Update()
{
}

/////////////////////
//描画
//引数：なし
//戻り値：なし
/////////////////////
void PlaySceneUI::Render()
{
}

/////////////////////
//終了処理
//引数：なし
//戻り値：なし
/////////////////////
void PlaySceneUI::Finalize()
{
}
